{
  "workExperiencenTimeline": [
    {
      "date": "2023 - Present",
      "logo": "risecodes_logo_webp.webp",
      "company": "Rise",
      "title": "MLops Engineer | Data Architect",
      "description": [
        "Designed and implemented end-to-end data architecture solutions from scratch, leveraging cutting-edge technologies to support complex machine learning models and analytics pipelines.",
        "Independently developed and deployed scalable machine learning models, optimizing for performance and accuracy, while ensuring compliance with data governance and security standards."
      ]
    },
    {
      "date": "2022 - 2023",
      "logo": "cloudyo_logo.webp",
      "company": "Cloudyo",
      "title": "Data Team Lead",
      "description": [
        "Led cross-functional teams in the implementation of Development best practices, resulting in a 30% improvement in release frequency and a 33% reduction in deployment failures.",
        "Spearheaded the adoption of cloud infrastructure (AWS) for the organization, leading to improved scalability and cost optimization.",
        "Mentored and trained junior team members on Development methodologies and tools, facilitating their professional growth and ensuring efficient knowledge sharing across the team."
      ]
    },
    {
      "date": "2021 - 2022",
      "logo": "rakuten_viber_logo.webp",
      "company": "Rakuten Viber",
      "title": "MLOps Engineer | Data Engineer",
      "description": [
        "Collaborated with cross-functional teams to design and build scalable data pipelines, reducing data processing time by 17% and improving overall system efficiency.",
        "Developed and implemented machine learning algorithms to optimize models in production",
        "Designed and built scalable machine learning pipelines, utilizing AWS platform to process and analyze large datasets."
      ]
    },
    {
      "date": "2019 - 2021",
      "logo": "akamai_logo.webp",
      "company": "Akamai Technologies",
      "title": "Performance Engineer",
      "description": [
        "Developed and implemented scalable big data solutions, utilizing technologies such as Hadoop and Spark, resulting in improved data processing efficiency by 27%",
        "Designed and maintained data pipelines to extract, transform, and load large volumes of structured and unstructured data from various sources, ensuring data integrity and accuracy."
      ]
    },
    {
      "date": "2017 - 2019",
      "logo": "commfident-logo.webp",
      "company": "Commfident",
      "title": "Data Scientist",
      "description": [
        "Developed and implemented machine learning algorithms to analyze and interpret complex data sets, resulting in improved accuracy and efficiency in predictive modeling.",
        "Conducted extensive data cleaning, feature engineering, and exploratory data analysis to identify trends and patterns, facilitating the development of actionable recommendations."
      ]
    }
  ]
}
